app/controllers/books_controller.rb

SELECT * FROM `books`
---
	def index


		@books = Book.all.paginate({:page => params[:page], :per_page => 3 , :order => 'books.created_at DESC'})

SELECT * FROM `books` WHERE (`books`.`id` = 0)
---
	def show
		@book = Book.find(params[:id])

INSERT INTO `books` (`tittle`, `price`, `subject_id`, `description`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES('dhdfhdh', 0.0, 184, 'dhzdhzdfhdzh', '2016-05-16 07:14:42', '2016-05-16 07:14:42', 'books1.jpg', 'image/jpeg', 10717, '2016-05-16 07:14:42')
---
	def create
		@book = Book.new(params[:book])
		if @book.save

SELECT * FROM `books` WHERE (`books`.`id` = 33)
---
	def edit
		@book = Book.find(params[:id])

SELECT * FROM `books` WHERE (`books`.`id` = 33)
UPDATE `books` SET `price` = 345676.0, `description` = 'rjdtyjdytfdhjgdhkdgk', `subject_id` = 195, `image_file_name` = 'image6.jpg', `image_file_size` = 16732, `image_updated_at` = '2016-05-17 07:05:58', `updated_at` = '2016-05-17 07:05:59' WHERE `id` = 84
---
	def update
		@book = Book.find(params[:id])
		if @book.update_attributes(params[:book])

DELETE FROM `books` WHERE `id` = 2
SELECT * FROM `books` WHERE (`books`.`id` = 2)
---
	def delete
		Book.find(params[:id]).destroy

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
---
	def show_subjects
		@subject = Subject.find(params[:id])

INSERT INTO `books` (`tittle`, `price`, `subject_id`, `description`, `created_at`, `updated_at`) VALUES('asasasas', 0.0, 176, 'asasa', '2016-05-13 06:11:45', '2016-05-13 06:11:45')
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 176)
SELECT * FROM `subjects`
---
	def add_book
		@book=Book.new(params[:books])
		binding.pry

		@id=@book.subject_id
		binding.pry
		if @book.save
			binding.pry
			@subject=Subject.find(@id)

		render :update do |page|

  		page.replace_html 'book_list', :partial => 'shared/show', :object => @subject

		end
		else

			@subjects = Subject.all