app/controllers/subjects_controller.rb

	def index
		@subjects=Subject.all
---
SELECT * FROM `subjects`

	def show
		@subject = Subject.find(params[:id])
---
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 2)

	def create
	 @subject=Subject.new(params[:subject])
	 if @subject.save
---
INSERT INTO `subjects` (`name`, `created_at`, `updated_at`) VALUES('Science', '2016-04-11 12:23:36', '2016-04-11 12:23:36')

	def destroy
		@subject=Subject.find(params[:id])
		@books=@subject.books
		@books.each do |book|
			book.destroy
		end

		Subject.find(params[:id]).destroy
		#@subject.destroy
		#
		#Subject.find(params[:id]).destroy
		#@subject.destroy
		#@book=Book.find_by_subject_id(params[:id])


		@subjects = Subject.all
---
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 3)
SELECT * FROM `books` WHERE (`books`.`subject_id` = '154') LIMIT 1
DELETE FROM `books` WHERE `id` = 1
DELETE FROM `subjects` WHERE `id` = 3
SELECT * FROM `subjects`