app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `crypted_password`, `password_salt`, `persistence_token`, `created_at`, `updated_at`, `roles`) VALUES('bittu2', 'b2@gmail.com', '64c585f549c16b93cc5c84e7e00ad8ff72f4f6dcee3dd21130eb09896dc05643d67fce758082a1176e8f7e7440cfb648aaab114ce7743957fea3ab451b28d7f7', 'A_xJnXZvCZzAasAFiSMH', 'ecf4bd2f42f6f9dd45b47502d8af9c50c8aa90e0f57f3757a6ce4c4fa3a1ddffdea6452dfad780fdbafbf02617b0b7406f0644506f1c59219fef1cced9a00879', '2016-05-17 09:18:52', '2016-05-17 09:18:52', NULL)
---
  def create

    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `password_salt` = 'it4IGNchzbb1nngtCump', `crypted_password` = 'fad74e9aba82d907a7596a5850d6007d76e9a69bd085a3bb1f1ac3dd722465bc255eb51797b8046fd766f2972842ad6c56fd1d8d6db0edf66ae9b49b958ee997', `persistence_token` = 'cbace77a514e00ff85b3698387fd14c7755f539326541ac8f7f7a898b0afe315ce0eaceedf12718a164714ac0912483dd505813bc26c1b6590bd6ff21a42c9bd', `updated_at` = '2016-05-09 12:48:12' WHERE `id` = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])